app/views/static/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
          <div class="card-header">
            <h4 class="my-0 font-weight-normal"><%= g.user.first_name %></h4>