app/controllers/static_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    puts "_" * 60
    puts login_path
    @gossips = Gossip.all