app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "lmc@outlook.fr"], ["LIMIT", 1]]
SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "created_at", "updated_at", "city_id", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    puts "*" * 60
    puts params
    puts "*" * 60

    # cherche s'il existe un utilisateur en base avec l’e-mail
    if User.find_by(email: params[:email])
      flash.now[:danger] = "Utilisateur deja en base"
      puts "toto"
      render "new"
    else
      @user = User.new(
        first_name: params[:first_name],
        last_name: params[:last_name],
        description: params[:description],
        email: params[:email],
        age: params[:age],
        city_id: City.all.sample.id, #City.find_by(name: params[:city]).id,
        password: params[:password],
      )
      if @user.save